export default {
  name: {
    name: '姓名',
    min: 1,
    max: 32,
    regex: /^[\u4e00-\u9fa5a-zA-Z\d\s_]*$/,
    tip: '仅限汉字/字母/数字/下划线/空格/个别生僻字不支持',
  },
  ipcName: {
    name: 'IPC用户名',
    min: 1,
    max: 16,
    regex: /^.{1,16}$/,
    tip: '请输入中文、大小写字母、数字、特殊字符及其组合',
  },
  origin: {
    name: '籍贯',
    min: 1,
    max: 64,
    regex: /^[\u4e00-\u9fa5a-zA-Z]{1,64}$/,
    tip: '仅限汉字/字母及其组合',
  },
  address: {
    name: '地址',
    min: 1,
    max: 128,
    regex: /^.{1,128}$/,
  },
  url: {
    name: 'URL地址',
    min: 1,
    max: 1024,
    regex:
      /^(https?|ftp):\/\/([a-zA-Z0-9.-]+(:[a-zA-Z0-9.&%$-]+)*@)*((25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9][0-9]?)(\.(25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9]?[0-9])){3}|([a-zA-Z0-9-]+\.)*[a-zA-Z0-9-]+\.([a-zA-Z]{2,}))(:[0-9]+)*(\/($|[a-zA-Z0-9.,?'\\+&%$#=~_-]+))*$/,
  },
  password: {
    name: '密码',
    min: 8,
    max: 16,
    regex:
      /(?!^(\d+|[a-zA-Z]+|[_~!@#$%^&*()[\]{}+-=.,;/\\|"']+)$)^[\w_~!@#$%^&*()[\]{}+-=.,;/\\|"']{6,18}$/,
    tip: '请输入数字、大小写字母、特殊字符及组合密码',
  },
  remark: {
    name: '备注',
    min: 1,
    max: 255,
    regex: /^.{1,255}$/,
  },
  phone: {
    name: '手机号',
    min: 11,
    max: 11,
    regex: /^1[0-9]{10}$/,
  },
  specialPlane: {
    name: '座机号',
    regex: /^([0-9]{3,4}-)?[0-9]{7,8}$/,
  },
  bankCard: {
    name: '银行卡号',
    regex: /^[1-9]\d{9,29}$/,
  },
  ip: {
    name: 'IP地址',
    regex:
      /(?=(\b|\D))(((\d{1,2})|(1\d{1,2})|(2[0-4]\d)|(25[0-5]))\.){3}((\d{1,2})|(1\d{1,2})|(2[0-4]\d)|(25[0-5]))(?=(\b|\D))/,
  },
  mac: {
    name: 'MAC地址',
    regex:
      /^[A-Fa-f0-9]{2}(-[A-Fa-f0-9]{2}){5}$|^[A-Fa-f0-9]{2}(:[A-Fa-f0-9]{2}){5}$/,
  },
  idCard: {
    name: '身份证号',
    regex:
      /^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,
  },
  email: {
    name: '邮箱',
    min: 1,
    max: 255,
    regex: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,
  },
};
